# Basic sqllite 3 library tutorial 
# Connection with python & Basic Function in sql

In [12]:
import sqlite3
import numpy as np 
import pandas as pd

# Create   .DB file ？

一些數據庫文件可以被存儲在特定的專有格式由用於創作數據庫文件的數據庫管理應用，以及它們的數據庫管理程序的實例是Microsoft Access軟件。通用數據庫文件，另一方面存儲在DB格式，和這些數據塊的文件被加蓋.db的擴展名。在Microsoft Access 2010中的應用程序也可以通過微軟Windows用戶用於創建，查看和編輯存儲在一個數據庫文件中的內容。這些通用的DB文件的內容可以包括結構化的組織中的字段和表格的文本數據，並且這些字段和表的數據類型也可以被包括在這些DB文件的內容。數據庫文件格式是由許多數據庫管理應用程序從Microsoft Access 2010的軟件支持之外，和DB文件可以導出並保存在其他數據庫文件格式，如CSV。 SQLite的軟件可以安裝，並通過Linux用戶用於創建，打開和編輯這些DB文件的內容。也有集成了數據導入存儲在這些DB文件的內容支持一些數據庫管理應用程序。

In [13]:
connection = sqlite3.connect('ken_chiang.db')
cursor = connection.cursor()

這邊看起來就是用 object orient programming 方式去寫的 

.execute 裡為 query 裡的語法

.commit 為確實執行此語法

----note---

在 execute 中 select 完的數據還是以 sqlite 檔案呈現 , 

除非在 .fetchall() --> 才可以轉成 list

In [14]:
try:
    cursor.execute('DELETE FROM employees')
    cursor.execute('CREATE TABLE employees(name TEXT , surname TEXT, salary REA)')
except:
    pass

In [15]:
cursor.execute("INSERT INTO employees VALUES('MARIA','Mayer',100000)")

connection.commit()

In [16]:
a = cursor.execute('SELECT * FROM employees')

a.fetchall()

[('MARIA', 'Mayer', 100000)]

In [6]:
name = "ken"
surname = "Data Analysist"
salary = 100000

In [7]:
cursor.execute("INSERT INTO employees VALUES(?,?,?)",(name,surname,salary))
connection.commit()

In [8]:
a = cursor.execute('SELECT * FROM employees')

a.fetchall()

[('MARIA', 'Mayer', 100000.0), ('ken', 'Data Analysist', 100000.0)]

In [9]:
class SQLinput_data:
    
    def __init__(self,name,surname,salary):
        self.name = name 
        self.surname = surname 
        self.salary = salary

In [10]:
insert_data = SQLinput_data('Denzel','cook',200000)
name,surname ,salary = insert_data.name , insert_data.surname , insert_data.salary

cursor.execute("INSERT INTO employees VALUES(?,?,?)",(name,surname,salary))
connection.commit()

a = cursor.execute('SELECT * FROM employees')
df = pd.DataFrame( a.fetchall() ,columns=["name","surname","salary"])

In [11]:
df

     name         surname    salary
0   MARIA           Mayer  100000.0
1     ken  Data Analysist  100000.0
2  Denzel            cook  200000.0